### pandas 01

In this notebook we will cover how we can check metadata of dataframe & select rows/columns from dataframe.

|S.No|Action|Command|Input|Output|
|:----|:-----|:-----:|:-----:|:-----:|
|1|Reading CSV file|pd.read_csv('netflix_titles.csv')|file name|pandas.core.frame.DataFrame (lets call this df)|
|2|Checkign the rows & column for returned dataframe using shape attribute|df.shape|-|tuple|
|3.1|Print nth top rows of dataframe  | df.head(n)| no of rows (optional default 5 rows) | table format data|
|3.2|Print nth last rows of dataframe  | df.tail(n)| no of rows(optional default 5 rows) | table format data|
|4.1|Printing metadata of dataframe|df.info()|-|Print the metadata like columns, datatype etc|
|4.2|Printing columns of dataframe|df.columns|-|pandas.core.indexes.base.Index|
|5.1|Fecth single row using iloc (integer locator) |df.iloc[0]|integer|pandas.core.indexes.base.Series|
|5.2|Fecth multiple row using iloc (integer locator)|df.iloc[[1,2,4..n]]|list of integers|pandas.core.frame.DataFrame|
|5.3|Fecth multiple row using iloc (integer locator) & select columns based on integer location|df.iloc[[2,4,5,8], [2,3,4]]|list of integers|pandas.core.frame.DataFrame|
|6.1|Fecth single row using loc (label locator) |df.iloc[0]|row label|pandas.core.indexes.base.Series|
|6.2|Fecth multiple row using loc (label locator)|df.iloc[[1,2,3..n]]|list of row labels|pandas.core.frame.DataFrame|
|6.3|Fecth single row using loc (label locator) & select columns based on label|df.loc[[2], ['title']]|list of labels|pandas.core.frame.DataFrame|
|6.4|Fecth multiple row using loc (label locator) & select columns based on label|df.loc[[2,4,5,8], ['title','director']]|list of labels|pandas.core.frame.DataFrame|
|7|Selecting the single column from dataframe|df['name']/dataframe.name|column-name|pandas.core.series.Series Series is like 1-D array.  Series also have index.|
|8|Selecting the multiple column from dataframe|df[['name1','name2','name3']]|list of column names|pandas.core.frame.DataFrame|
|9|Selecting the unique data in column |df.columnname.unique()|columnname|array|
|10|Selecting the unique data in column with counts like group by sql|df.columnname.value_counts()|columnname|pandas.core.series.Series|

In [1]:
import pandas as pd
print("Let's start exploring", '\U0001F43C' , 'using',"\U0001F40D")

Let's start exploring üêº using üêç

In [2]:
# 1. read the csv file as pandas dataframe. Dataset from https://www.kaggle.com/
df = pd.read_csv('netflix_titles.csv')

In [3]:
# checking the type of the df 
type(df)

pandas.core.frame.DataFrame

In [4]:
# 2. Checking the rows & column in dataframe
df.shape

(6234, 12)

In [5]:
# 3.1 print top 5 rows 
df.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,81145628,NaN,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","Alan Marriott, Andrew Toth, Brian Dobson, Cole...","United States, India, South Korea, China","September 9, 2019",2019,TV-PG,90 min,"Children & Family Movies, Comedies",Before planning an awesome wedding for his gra...
1,80117401,NaN,Jandino: Whatever it Takes,NaN,Jandino Asporaat,United Kingdom,"September 9, 2016",2016,TV-MA,94 min,Stand-Up Comedy,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,NaN,"Peter Cullen, Sumalee Montano, Frank Welker, J...",United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,Kids' TV,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,NaN,"Will Friedle, Darren Criss, Constance Zimmer, ...",United States,"September 8, 2018",2016,TV-Y7,1 Season,Kids' TV,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,Fernando Lebrija,"Nesta Cooper, Kate Walsh, John Michael Higgins...",United States,"September 8, 2017",2017,TV-14,99 min,Comedies,When nerdy high schooler Dani finally attracts...

In [6]:
# 3.2 print last 2 rows 
df.tail(2)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
6232,70281022,TV Show,A Young Doctor's Notebook and Other Stories,NaN,"Daniel Radcliffe, Jon Hamm, Adam Godley, Chris...",United Kingdom,NaN,2013,TV-MA,2 Seasons,"British TV Shows, TV Comedies, TV Dramas","Set during the Russian Revolution, this comic ..."
6233,70153404,TV Show,Friends,NaN,"Jennifer Aniston, Courteney Cox, Lisa Kudrow, ...",United States,NaN,2003,TV-14,10 Seasons,"Classic & Cult TV, TV Comedies",This hit sitcom follows the merry misadventure...

In [7]:
# 4.1 Print the metadata of dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6234 entries, 0 to 6233
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       6234 non-null   int64
 1   type          6232 non-null   object
 2   title         6234 non-null   object
 3   director      4265 non-null   object
 4   cast          5664 non-null   object
 5   country       5758 non-null   object
 6   date_added    6223 non-null   object
 7   release_year  6234 non-null   int64
 8   rating        6224 non-null   object
 9   duration      6234 non-null   object
 10  listed_in     6234 non-null   object
 11  description   6234 non-null   object
dtypes: int64(2), object(10)
memory usage: 584.6+ KB

In [8]:
# 4.2 columns of dataframe
df.columns

Index(['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in', 'description'],
      dtype='object')

In [9]:
# 5.1 Fectch singe row using iloc - integer location - return series 
df.iloc[0]

show_id                                                  81145628
type                                                          NaN
title                     Norm of the North: King Sized Adventure
director                                 Richard Finn, Tim Maltby
cast            Alan Marriott, Andrew Toth, Brian Dobson, Cole...
country                  United States, India, South Korea, China
date_added                                      September 9, 2019
release_year                                                 2019
rating                                                      TV-PG
duration                                                   90 min
listed_in                      Children & Family Movies, Comedies
description     Before planning an awesome wedding for his gra...
Name: 0, dtype: object

In [10]:
# 5.2 Fectch multiple row using iloc - integer location - return dataframe 
df.iloc[[2,4,5,8]]

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
2,70234439,TV Show,Transformers Prime,NaN,"Peter Cullen, Sumalee Montano, Frank Welker, J...",United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,Kids' TV,"With the help of three human allies, the Autob..."
4,80125979,Movie,#realityhigh,Fernando Lebrija,"Nesta Cooper, Kate Walsh, John Michael Higgins...",United States,"September 8, 2017",2017,TV-14,99 min,Comedies,When nerdy high schooler Dani finally attracts...
5,80163890,TV Show,Apaches,NaN,"Alberto Ammann, Eloy Azor√≠n, Ver√≥nica Echegui,...",Spain,"September 8, 2017",2016,TV-MA,1 Season,"Crime TV Shows, International TV Shows, Spanis...",A young journalist is forced into a life of cr...
8,80117902,TV Show,Fire Chasers,NaN,NaN,United States,"September 8, 2017",2017,TV-MA,1 Season,"Docuseries, Science & Nature TV","As California's 2016 fire season rages, brave ..."

In [11]:
# 5.3 Fectch multiple row/columns using iloc - integer location - return dataframe
df.iloc[[2,4,5,8], [2,3,4]]

,title,director,cast
2,Transformers Prime,NaN,"Peter Cullen, Sumalee Montano, Frank Welker, J..."
4,#realityhigh,Fernando Lebrija,"Nesta Cooper, Kate Walsh, John Michael Higgins..."
5,Apaches,NaN,"Alberto Ammann, Eloy Azor√≠n, Ver√≥nica Echegui,..."
8,Fire Chasers,NaN,NaN

In [12]:
# 6.1 Fectch rows using loc - label location - return dataframe 
df.loc[[2,4,5,8], ['title','director']]

                title          director
2  Transformers Prime               NaN
4        #realityhigh  Fernando Lebrija
5             Apaches               NaN
8        Fire Chasers               NaN

In [13]:
# 6.2 Fectch rows using loc - label location - return dataframe 
df.loc[6230:6233, 'title':'country']

,title,director,cast,country
6230,Maron,NaN,"Marc Maron, Judd Hirsch, Josh Brener, Nora Zeh...",United States
6231,Little Baby Bum: Nursery Rhyme Friends,NaN,NaN,NaN
6232,A Young Doctor's Notebook and Other Stories,NaN,"Daniel Radcliffe, Jon Hamm, Adam Godley, Chris...",United Kingdom
6233,Friends,NaN,"Jennifer Aniston, Courteney Cox, Lisa Kudrow, ...",United States

In [14]:
# 7. Selecting the single column another way: dataframe['column-name']
df.title

0           Norm of the North: King Sized Adventure
1                        Jandino: Whatever it Takes
2                                Transformers Prime
3                  Transformers: Robots in Disguise
4                                      #realityhigh
                           ...
6229                                   Red vs. Blue
6230                                          Maron
6231         Little Baby Bum: Nursery Rhyme Friends
6232    A Young Doctor's Notebook and Other Stories
6233                                        Friends
Name: title, Length: 6234, dtype: object

In [15]:
type(df.title)

pandas.core.series.Series

Series is like 1-D array.  Series also have index.

In [16]:
# 8. Selecting the multiple column from dataframe
df[['title','director','country']]

,title,director,country
0,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","United States, India, South Korea, China"
1,Jandino: Whatever it Takes,NaN,United Kingdom
2,Transformers Prime,NaN,United States
3,Transformers: Robots in Disguise,NaN,United States
4,#realityhigh,Fernando Lebrija,United States
...,...,...,...
6229,Red vs. Blue,NaN,United States
6230,Maron,NaN,United States
6231,Little Baby Bum: Nursery Rhyme Friends,NaN,NaN
6232,A Young Doctor's Notebook and Other Stories,NaN,United Kingdom
6233,Friends,NaN,United States

In [17]:
# 9. Selecting the unique data in column
df.type.unique()

array([nan, 'TV Show', 'Movie'], dtype=object)

In [18]:
# 10. Selecting the unique data in column with counts like group by count in sql
df.type.value_counts()

Movie      4263
TV Show    1969
Name: type, dtype: int64